{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "GroundingDinoForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": null,
  "backbone_config": {
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      6,
      2
    ],
    "drop_path_rate": 0.1,
    "dtype": "float32",
    "embed_dim": 96,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "image_size": 224,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_channels": 3,
    "num_heads": [
      3,
      6,
      12,
      24
    ],
    "num_layers": 4,
    "out_features": [
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      2,
      3,
      4
    ],
    "patch_size": 4,
    "qkv_bias": true,
    "stage_names": [
      "stem",
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "use_absolute_embeddings": false,
    "window_size": 7
  },
  "bbox_cost": 5.0,
  "bbox_loss_coefficient": 5.0,
  "class_cost": 1.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_bbox_embed_share": true,
  "decoder_ffn_dim": 2048,
  "decoder_layers": 6,
  "decoder_n_points": 4,
  "disable_custom_kernels": false,
  "dropout": 0.1,
  "dtype": "float32",
  "embedding_init_target": true,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layers": 6,
  "encoder_n_points": 4,
  "focal_alpha": 0.25,
  "fusion_dropout": 0.0,
  "fusion_droppath": 0.1,
  "giou_cost": 2.0,
  "giou_loss_coefficient": 2.0,
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "layer_norm_eps": 1e-05,
  "max_text_len": 256,
  "model_type": "grounding-dino",
  "num_feature_levels": 4,
  "num_queries": 900,
  "position_embedding_type": "sine",
  "positional_embedding_temperature": 20,
  "query_dim": 4,
  "text_config": {
    "add_cross_attention": false,
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": null,
    "classifier_dropout": null,
    "dtype": "float32",
    "eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "tie_word_embeddings": true,
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 30522
  },
  "text_enhancer_dropout": 0.0,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "two_stage": true,
  "two_stage_bbox_embed_share": false
}
